In [27]:
import pandas as pd
import numpy as np
from scipy.sparse import csr_matrix
import sklearn
from sklearn.decomposition import TruncatedSVD

book_path = '/Users/reiven/Documents/Python/CSCI4710/Lab10/BX-CSV-Dump/BX-Books.csv'
user_path = '/Users/reiven/Documents/Python/CSCI4710/Lab10/BX-CSV-Dump/BX-Users.csv'
rating_path = '/Users/reiven/Documents/Python/CSCI4710/Lab10/BX-CSV-Dump/BX-Book-Ratings.csv'

book = pd.read_csv(book_path, sep=';', error_bad_lines=False, encoding="latin-1")
book.columns = ['ISBN', 'bookTitle', 'bookAuthor', 'yearOfPublication', 'publisher', 'imageUrlS', 'imageUrlM', 'imageUrlL']
user = pd.read_csv(user_path, sep=';', error_bad_lines=False, encoding="latin-1")
user.columns = ['userID', 'Location', 'Age']
rating = pd.read_csv(rating_path, sep=';', error_bad_lines=False, encoding="latin-1")
rating.columns = ['userID', 'ISBN', 'bookRating']

b'Skipping line 6452: expected 8 fields, saw 9\nSkipping line 43667: expected 8 fields, saw 10\nSkipping line 51751: expected 8 fields, saw 9\n'

b'Skipping line 92038: expected 8 fields, saw 9\nSkipping line 104319: expected 8 fields, saw 9\nSkipping line 121768: expected 8 fields, saw 9\n'

b'Skipping line 144058: expected 8 fields, saw 9\nSkipping line 150789: expected 8 fields, saw 9\nSkipping line 157128: expected 8 fields, saw 9\nSkipping line 180189: expected 8 fields, saw 9\nSkipping line 185738: expected 8 fields, saw 9\n'

b'Skipping line 209388: expected 8 fields, saw 9\nSkipping line 220626: expected 8 fields, saw 9\nSkipping line 227933: expected 8 fields, saw 11\nSkipping line 228957: expected 8 fields, saw 10\nSkipping line 245933: expected 8 fields, saw 9\nSkipping line 251296: expected 8 fields, saw 9\nSkipping line 259941: expected 8 fields, saw 9\nSkipping line 261529: expected 8 fields, saw 9\n'

/Users/reiven/anaconda3/lib/python3.6/site-packages/IPython/core/interactiveshell.py:2698: DtypeWarning: Columns (3) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [28]:
rating.head()

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>userID</th>
      <th>ISBN</th>
      <th>bookRating</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>276725</td>
      <td>034545104X</td>
      <td>0</td>
    </tr>
    <tr>
      <th>1</th>
      <td>276726</td>
      <td>0155061224</td>
      <td>5</td>
    </tr>
    <tr>
      <th>2</th>
      <td>276727</td>
      <td>0446520802</td>
      <td>0</td>
    </tr>
    <tr>
      <th>3</th>
      <td>276729</td>
      <td>052165615X</td>
      <td>3</td>
    </tr>
    <tr>
      <th>4</th>
      <td>276729</td>
      <td>0521795028</td>
      <td>6</td>
    </tr>
  </tbody>
</table>
</div>

In [29]:
user.head()

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>userID</th>
      <th>Location</th>
      <th>Age</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1</td>
      <td>nyc, new york, usa</td>
      <td>nan</td>
    </tr>
    <tr>
      <th>1</th>
      <td>2</td>
      <td>stockton, california, usa</td>
      <td>18.000</td>
    </tr>
    <tr>
      <th>2</th>
      <td>3</td>
      <td>moscow, yukon territory, russia</td>
      <td>nan</td>
    </tr>
    <tr>
      <th>3</th>
      <td>4</td>
      <td>porto, v.n.gaia, portugal</td>
      <td>17.000</td>
    </tr>
    <tr>
      <th>4</th>
      <td>5</td>
      <td>farnborough, hants, united kingdom</td>
      <td>nan</td>
    </tr>
  </tbody>
</table>
</div>

In [30]:
book.head()

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>ISBN</th>
      <th>bookTitle</th>
      <th>bookAuthor</th>
      <th>yearOfPublication</th>
      <th>publisher</th>
      <th>imageUrlS</th>
      <th>imageUrlM</th>
      <th>imageUrlL</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>0195153448</td>
      <td>Classical Mythology</td>
      <td>Mark P. O. Morford</td>
      <td>2002</td>
      <td>Oxford University Press</td>
      <td>http://images.amazon.com/images/P/0195153448.0...</td>
      <td>http://images.amazon.com/images/P/0195153448.0...</td>
      <td>http://images.amazon.com/images/P/0195153448.0...</td>
    </tr>
    <tr>
      <th>1</th>
      <td>0002005018</td>
      <td>Clara Callan</td>
      <td>Richard Bruce Wright</td>
      <td>2001</td>
      <td>HarperFlamingo Canada</td>
      <td>http://images.amazon.com/images/P/0002005018.0...</td>
      <td>http://images.amazon.com/images/P/0002005018.0...</td>
      <td>http://images.amazon.com/images/P/0002005018.0...</td>
    </tr>
    <tr>
      <th>2</th>
      <td>0060973129</td>
      <td>Decision in Normandy</td>
      <td>Carlo D'Este</td>
      <td>1991</td>
      <td>HarperPerennial</td>
      <td>http://images.amazon.com/images/P/0060973129.0...</td>
      <td>http://images.amazon.com/images/P/0060973129.0...</td>
      <td>http://images.amazon.com/images/P/0060973129.0...</td>
    </tr>
    <tr>
      <th>3</th>
      <td>0374157065</td>
      <td>Flu: The Story of the Great Influenza Pandemic...</td>
      <td>Gina Bari Kolata</td>
      <td>1999</td>
      <td>Farrar Straus Giroux</td>
      <td>http://images.amazon.com/images/P/0374157065.0...</td>
      <td>http://images.amazon.com/images/P/0374157065.0...</td>
      <td>http://images.amazon.com/images/P/0374157065.0...</td>
    </tr>
    <tr>
      <th>4</th>
      <td>0393045218</td>
      <td>The Mummies of Urumchi</td>
      <td>E. J. W. Barber</td>
      <td>1999</td>
      <td>W. W. Norton &amp;amp; Company</td>
      <td>http://images.amazon.com/images/P/0393045218.0...</td>
      <td>http://images.amazon.com/images/P/0393045218.0...</td>
      <td>http://images.amazon.com/images/P/0393045218.0...</td>
    </tr>
  </tbody>
</table>
</div>

In [31]:
combine_book_rating = pd.merge(rating, book, on='ISBN')
columns = ['yearOfPublication', 'publisher', 'bookAuthor', 'imageUrlS', 'imageUrlM', 'imageUrlL']
combine_book_rating = combine_book_rating.drop(columns, axis=1)
combine_book_rating.head()

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>userID</th>
      <th>ISBN</th>
      <th>bookRating</th>
      <th>bookTitle</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>276725</td>
      <td>034545104X</td>
      <td>0</td>
      <td>Flesh Tones: A Novel</td>
    </tr>
    <tr>
      <th>1</th>
      <td>2313</td>
      <td>034545104X</td>
      <td>5</td>
      <td>Flesh Tones: A Novel</td>
    </tr>
    <tr>
      <th>2</th>
      <td>6543</td>
      <td>034545104X</td>
      <td>0</td>
      <td>Flesh Tones: A Novel</td>
    </tr>
    <tr>
      <th>3</th>
      <td>8680</td>
      <td>034545104X</td>
      <td>5</td>
      <td>Flesh Tones: A Novel</td>
    </tr>
    <tr>
      <th>4</th>
      <td>10314</td>
      <td>034545104X</td>
      <td>9</td>
      <td>Flesh Tones: A Novel</td>
    </tr>
  </tbody>
</table>
</div>

### Filter to only popular books

Remove rows where book title is missing

In [32]:
combine_book_rating = combine_book_rating.dropna(axis = 0, subset = ['bookTitle'])

In [33]:
book_ratingCount = (combine_book_rating.
     groupby(by = ['bookTitle'])['bookRating'].
     count().
     reset_index().
     rename(columns = {'bookRating': 'totalRatingCount'})
     [['bookTitle', 'totalRatingCount']]
    )
book_ratingCount.head()

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>bookTitle</th>
      <th>totalRatingCount</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>A Light in the Storm: The Civil War Diary of ...</td>
      <td>4</td>
    </tr>
    <tr>
      <th>1</th>
      <td>Always Have Popsicles</td>
      <td>1</td>
    </tr>
    <tr>
      <th>2</th>
      <td>Apple Magic (The Collector's series)</td>
      <td>1</td>
    </tr>
    <tr>
      <th>3</th>
      <td>Ask Lily (Young Women of Faith: Lily Series, ...</td>
      <td>1</td>
    </tr>
    <tr>
      <th>4</th>
      <td>Beyond IBM: Leadership Marketing and Finance ...</td>
      <td>1</td>
    </tr>
  </tbody>
</table>
</div>

#### Now we can merge the total rating count data into the rating data, giving us exactly what we need to filter out the lesser known books.

In [9]:
rating_with_totalRatingCount = combine_book_rating.merge(book_ratingCount, left_on = 'bookTitle', right_on = 'bookTitle', how = 'left')
rating_with_totalRatingCount.head()

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>userID</th>
      <th>ISBN</th>
      <th>bookRating</th>
      <th>bookTitle</th>
      <th>totalRatingCount</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>276725</td>
      <td>034545104X</td>
      <td>0</td>
      <td>Flesh Tones: A Novel</td>
      <td>60</td>
    </tr>
    <tr>
      <th>1</th>
      <td>2313</td>
      <td>034545104X</td>
      <td>5</td>
      <td>Flesh Tones: A Novel</td>
      <td>60</td>
    </tr>
    <tr>
      <th>2</th>
      <td>6543</td>
      <td>034545104X</td>
      <td>0</td>
      <td>Flesh Tones: A Novel</td>
      <td>60</td>
    </tr>
    <tr>
      <th>3</th>
      <td>8680</td>
      <td>034545104X</td>
      <td>5</td>
      <td>Flesh Tones: A Novel</td>
      <td>60</td>
    </tr>
    <tr>
      <th>4</th>
      <td>10314</td>
      <td>034545104X</td>
      <td>9</td>
      <td>Flesh Tones: A Novel</td>
      <td>60</td>
    </tr>
  </tbody>
</table>
</div>

In [34]:
pd.set_option('display.float_format', lambda x: '%.3f' % x)
print(book_ratingCount['totalRatingCount'].describe())

count   241071.000
mean         4.277
std         16.739
min          1.000
25%          1.000
50%          1.000
75%          3.000
max       2502.000
Name: totalRatingCount, dtype: float64

#### The median book has only been rated one time. Let’s take a look at the top of the distribution.

In [35]:
print(book_ratingCount['totalRatingCount'].quantile(np.arange(.9, 1, .01)))

0.900    7.000
0.910    8.000
0.920    9.000
0.930   10.000
0.940   11.000
0.950   13.000
0.960   16.000
0.970   20.000
0.980   29.000
0.990   50.000
Name: totalRatingCount, dtype: float64

#### So about 1% of books have 50 ratings, 2% have 29 ratings. Since we have so many books in our data, we’ll limit it to the top 1%, this will give us 2713 different books.

In [37]:
popularity_threshold = 50
rating_popular_book = rating_with_totalRatingCount.query('totalRatingCount >= @popularity_threshold')
rating_popular_book.head()

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>userID</th>
      <th>ISBN</th>
      <th>bookRating</th>
      <th>bookTitle</th>
      <th>totalRatingCount</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>276725</td>
      <td>034545104X</td>
      <td>0</td>
      <td>Flesh Tones: A Novel</td>
      <td>60</td>
    </tr>
    <tr>
      <th>1</th>
      <td>2313</td>
      <td>034545104X</td>
      <td>5</td>
      <td>Flesh Tones: A Novel</td>
      <td>60</td>
    </tr>
    <tr>
      <th>2</th>
      <td>6543</td>
      <td>034545104X</td>
      <td>0</td>
      <td>Flesh Tones: A Novel</td>
      <td>60</td>
    </tr>
    <tr>
      <th>3</th>
      <td>8680</td>
      <td>034545104X</td>
      <td>5</td>
      <td>Flesh Tones: A Novel</td>
      <td>60</td>
    </tr>
    <tr>
      <th>4</th>
      <td>10314</td>
      <td>034545104X</td>
      <td>9</td>
      <td>Flesh Tones: A Novel</td>
      <td>60</td>
    </tr>
  </tbody>
</table>
</div>

#### Filtering to US users only

In [38]:
combined = rating_popular_book.merge(user, left_on = 'userID', right_on = 'userID', how = 'left')

us_canada_user_rating = combined[combined['Location'].str.contains("usa|canada")]
us_canada_user_rating=us_canada_user_rating.drop('Age', axis=1)
us_canada_user_rating.head()

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>userID</th>
      <th>ISBN</th>
      <th>bookRating</th>
      <th>bookTitle</th>
      <th>totalRatingCount</th>
      <th>Location</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>276725</td>
      <td>034545104X</td>
      <td>0</td>
      <td>Flesh Tones: A Novel</td>
      <td>60</td>
      <td>tyler, texas, usa</td>
    </tr>
    <tr>
      <th>1</th>
      <td>2313</td>
      <td>034545104X</td>
      <td>5</td>
      <td>Flesh Tones: A Novel</td>
      <td>60</td>
      <td>cincinnati, ohio, usa</td>
    </tr>
    <tr>
      <th>2</th>
      <td>6543</td>
      <td>034545104X</td>
      <td>0</td>
      <td>Flesh Tones: A Novel</td>
      <td>60</td>
      <td>strafford, missouri, usa</td>
    </tr>
    <tr>
      <th>3</th>
      <td>8680</td>
      <td>034545104X</td>
      <td>5</td>
      <td>Flesh Tones: A Novel</td>
      <td>60</td>
      <td>st. charles county, missouri, usa</td>
    </tr>
    <tr>
      <th>4</th>
      <td>10314</td>
      <td>034545104X</td>
      <td>9</td>
      <td>Flesh Tones: A Novel</td>
      <td>60</td>
      <td>beaverton, oregon, usa</td>
    </tr>
  </tbody>
</table>
</div>

In [39]:
if not us_canada_user_rating[us_canada_user_rating.duplicated(['userID', 'bookTitle'])].empty:
    initial_rows = us_canada_user_rating.shape[0]

    print('Initial dataframe shape {0}'.format(us_canada_user_rating.shape))
    us_canada_user_rating = us_canada_user_rating.drop_duplicates(['userID', 'bookTitle'])
    current_rows = us_canada_user_rating.shape[0]
    print('New dataframe shape {0}'.format(us_canada_user_rating.shape))
    print('Removed {0} rows'.format(initial_rows - current_rows))

Initial dataframe shape (251615, 6)
New dataframe shape (248949, 6)
Removed 2666 rows

In [54]:
us_canada_user_rating_pivot = us_canada_user_rating.pivot(index = 'bookTitle', columns = 'userID', values = 'bookRating').fillna(0)
us_canada_user_rating_matrix = csr_matrix(us_canada_user_rating_pivot.values)

#######
# Use following 2 print to understand style of vector to calculate distance to find k nearest neighbor items
# print(us_canada_user_rating_pivot)
# print(us_canada_user_rating_pivot.shape)

In [57]:
from sklearn.neighbors import NearestNeighbors

model_knn = NearestNeighbors(metric = 'cosine', algorithm = 'brute')
model_knn.fit(us_canada_user_rating_matrix)

NearestNeighbors(algorithm='brute', leaf_size=30, metric='cosine',
         metric_params=None, n_jobs=1, n_neighbors=5, p=2, radius=1.0)

In [42]:
query_index = np.random.choice(us_canada_user_rating_pivot.shape[0])
distances, indices = model_knn.kneighbors(us_canada_user_rating_pivot.iloc[query_index, :].reshape(1, -1), n_neighbors = 6)

for i in range(0, len(distances.flatten())):
    if i == 0:
        print('Recommendations for {0}:\n'.format(us_canada_user_rating_pivot.index[query_index]))
    else:
        print('{0}: {1}, with distance of {2}:'.format(i, us_canada_user_rating_pivot.index[indices.flatten()[i]], distances.flatten()[i]))

Recommendations for Creature:

1: Guardian, with distance of 0.776614401399353:
2: Watchers, with distance of 0.7817435238444208:
3: Darkness, with distance of 0.8262038414170726:
4: Nathaniel, with distance of 0.8287734112852231:
5: Private Eyes (Alex Delaware Novels (Paperback)), with distance of 0.8583820495870199:

/Users/reiven/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:2: FutureWarning: reshape is deprecated and will raise in a subsequent release. Please use .values.reshape(...) instead

Perfect! "Green Mile Series" books are definitely should be recommended one after another.

In [43]:
us_canada_user_rating_pivot2 = us_canada_user_rating.pivot(index = 'userID', columns = 'bookTitle', values = 'bookRating').fillna(0)

In [58]:
print(us_canada_user_rating_pivot2.head())

bookTitle  10 Lb. Penalty  16 Lighthouse Road  1984  1st to Die: A Novel  \
userID
8                   0.000               0.000 0.000                0.000
9                   0.000               0.000 0.000                0.000
14                  0.000               0.000 0.000                0.000
16                  0.000               0.000 0.000                0.000
17                  0.000               0.000 0.000                0.000

bookTitle  2010: Odyssey Two  204 Rosewood Lane  2061: Odyssey Three  \
userID
8                      0.000              0.000                0.000
9                      0.000              0.000                0.000
14                     0.000              0.000                0.000
16                     0.000              0.000                0.000
17                     0.000              0.000                0.000

bookTitle  24 Hours  2nd Chance  3rd Degree    ...     YOU BELONG TO ME  \
userID                                         ...
8             0.000       0.000       0.000    ...                0.000
9             0.000       0.000       0.000    ...                0.000
14            0.000       0.000       0.000    ...                0.000
16            0.000       0.000       0.000    ...                0.000
17            0.000       0.000       0.000    ...                0.000

bookTitle  Year of Wonders  You Belong To Me  You Shall Know Our Velocity  \
userID
8                    0.000             0.000                        0.000
9                    0.000             0.000                        0.000
14                   0.000             0.000                        0.000
16                   0.000             0.000                        0.000
17                   0.000             0.000                        0.000

bookTitle  Young Wives  \
userID
8                0.000
9                0.000
14               0.000
16               0.000
17               0.000

bookTitle  Zen and the Art of Motorcycle Maintenance: An Inquiry into Values  \
userID
8                                                      0.000
9                                                      0.000
14                                                     0.000
16                                                     0.000
17                                                     0.000

bookTitle  Zoya  \O\" Is for Outlaw"  \
userID
8         0.000                0.000
9         0.000                0.000
14        0.000                0.000
16        0.000                0.000
17        0.000                0.000

bookTitle  \Surely You're Joking, Mr. Feynman!\": Adventures of a Curious Character"  \
userID
8                                                      0.000
9                                                      0.000
14                                                     0.000
16                                                     0.000
17                                                     0.000

bookTitle  stardust
userID
8             0.000
9             0.000
14            0.000
16            0.000
17            0.000

[5 rows x 2442 columns]

In [46]:
us_canada_user_rating_pivot2.shape

(40017, 2442)

In [47]:
X = us_canada_user_rating_pivot2.values.T
X.shape

(2442, 40017)

In [61]:
import sklearn
from sklearn.decomposition import TruncatedSVD

SVD = TruncatedSVD(n_components=12, random_state=17)
matrix = SVD.fit_transform(X)
matrix.shape

(2442, 12)

In [59]:
import warnings
warnings.filterwarnings("ignore",category =RuntimeWarning)
corr = np.corrcoef(matrix)
corr.shape

[[ 1.          0.32835462  0.28721468 ...,  0.45692002  0.59368593
   0.54871412]
 [ 0.32835462  1.          0.03518765 ...,  0.095986    0.10268757
   0.27527237]
 [ 0.28721468  0.03518765  1.         ...,  0.19244098  0.82507425
   0.69195732]
 ...,
 [ 0.45692002  0.095986    0.19244098 ...,  1.          0.14009977
  -0.04473414]
 [ 0.59368593  0.10268757  0.82507425 ...,  0.14009977  1.          0.82172821]
 [ 0.54871412  0.27527237  0.69195732 ..., -0.04473414  0.82172821  1.        ]]

In [50]:
us_canada_book_title = us_canada_user_rating_pivot2.columns
us_canada_book_list = list(us_canada_book_title)
coffey_hands = us_canada_book_list.index("The Green Mile: Coffey's Hands (Green Mile Series)")
print(coffey_hands)

1906

In [51]:
corr_coffey_hands  = corr[coffey_hands]

In [52]:
list(us_canada_book_title[(corr_coffey_hands<1.0) & (corr_coffey_hands>0.9)])

['Needful Things',
 'The Bachman Books: Rage, the Long Walk, Roadwork, the Running Man',
 'The Green Mile: Coffey on the Mile (Green Mile Series)',
 'The Green Mile: Night Journey (Green Mile Series)',
 'The Green Mile: The Bad Death of Eduard Delacroix (Green Mile Series)',
 'The Green Mile: The Mouse on the Mile (Green Mile Series)',
 'The Shining',
 'The Two Dead Girls (Green Mile Series)']

The results look great!

----

## Question 3

Explain how the kNN model predicts recommendations

kNN model calculate each books user's rating vectors(v_1,v_2) cosine distance.

Then find nearest n items as similar item to recommend.

![](https://github.com/reiven-c-t/CSCI4710/raw/master/Lab10/table_eg.jpg)

## Question 4

Explain how to interpret the contents of the three matrices in the SVD model for this dataset (i.e., users and book ratings) .

First, SVD decomposition is following matrix calculation.

![](https://github.com/reiven-c-t/CSCI4710/raw/master/Lab10/SVD_img.jpg)

In this time, $X$ is the original data that each row has user's rating for a book.

$U$ is the matrix that each row is book's decomposed feature vector. Diagonal component of $S$ explain the effectiveness of decomposition.

Also, what we get in result of `matrix = SVD.fit_transform(X)`, it shows each movie's decomposed feature vector.
So, `corr = np.corrcoef(matrix)` is calcurated correlation(similarity) of each 2 movie set.